## 1. Importing Libraries

In [12]:
import pandas as pd
import numpy as np
import os

In [13]:
## Creating a pathname to easily access our data
pathname=r'/Users/alejandrocisneros/Desktop/Data Analysis Coursework/Data Immersion/Achievement 4/02-2024 Instacart Basket Analysis'

In [14]:
pathname

'/Users/alejandrocisneros/Desktop/Data Analysis Coursework/Data Immersion/Achievement 4/02-2024 Instacart Basket Analysis'

In [16]:
#Importing cleaned product and order csv files
df_orders=pd.read_csv(os.path.join(pathname, '2. Data', 'Prepared Data', 'orders_clean.csv'))
df_products=pd.read_csv(os.path.join(pathname, '2. Data', 'Prepared Data', 'products_checked.csv'))

In [17]:
#Importing order_products_prior.csv file, which will be merged later on with df_orders
df_ords_prior=pd.read_csv(os.path.join(pathname, '2. Data', 'Original Data', 'orders_products_prior.csv'))

In [29]:
#Testing 
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [30]:
#Checking numbers of columns and rows for df
df_ords_prior.shape

(32434489, 4)

In [31]:
#Checking numbers of columns and rows for df
df_orders.shape

(3421083, 8)

In [32]:
#We merge the imported 'products_prior' csv file with the cleaned order csv, with the 'product_id' as the common key
df_ords_merged=df_orders.merge(df_ords_prior, on='order_id', indicator=True)

In [33]:
df_ords_merged.head(10)

,Unnamed: 0.1,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,0,0,2539329,1,1,2,8,11.114836,196,1,0,both
1,0,0,2539329,1,1,2,8,11.114836,14084,2,0,both
2,0,0,2539329,1,1,2,8,11.114836,12427,3,0,both
3,0,0,2539329,1,1,2,8,11.114836,26088,4,0,both
4,0,0,2539329,1,1,2,8,11.114836,26405,5,0,both
5,1,1,2398795,1,2,3,7,15.000000,196,1,1,both
6,1,1,2398795,1,2,3,7,15.000000,10258,2,0,both
7,1,1,2398795,1,2,3,7,15.000000,12427,3,1,both
8,1,1,2398795,1,2,3,7,15.000000,13176,4,0,both
9,1,1,2398795,1,2,3,7,15.000000,26088,5,1,both

In [35]:
#This value counts will tell us how many of the 'merge' columns values are both, left_only or right_only join
df_ords_merged['_merge'].value_counts()

_merge
both          32434489
left_only            0
right_only           0
Name: count, dtype: int64

In [36]:
# Means there was a full match for all values of both dataframes, which translates to no missing values

In [42]:
#Once we have checked, remove the 'merge' column so you can create another merge flag in final merge operation
df_ords_merged=df_ords_merged.drop(columns=['_merge'])

In [44]:
#Exporting in pickle format
df_ords_merged.to_pickle(os.path.join(pathname, '2. Data', 'Prepared Data', 'order_products_combined.pkl'))